# created by gilad ticher

cask_args appdir: '/Applications'
tap 'homebrew/bundle'

brew 'mas'                      # Mac App Store command-line interface
cask 'docker'                   # Containerization platform
# brew 'whalebrew'                 # Homebrew, but with Docker images'

brew 'openjdk'                  # Open-source implementation of the Java Platform
# brew 'ffmpeg'                   # Play, record, convert, and stream audio and video
# brew 'imagemagick'              # Image processing tools
brew 'git-lfs'                  # Git extension for versioning large files
brew 'pandoc'                   # Swiss-army knife of markup format conversion

cask 'arc'                      # Chromium based browser
cask 'calibre'                  # eBook Manager
# cask 'cursor'                   # Write, edit, and chat about your code with AI
# cask 'ghidra'                   # Software reverse engineering (SRE) suite of tools
cask 'google-drive'             # Cloud Storage
cask 'jetbrains-toolbox'        # JetBrains tools manager
cask 'keka'                     # File Archiver
cask 'mactex'                   # Full TeX Live distribution with GUI applications
cask 'lyx'                      # GUI document processor based on the LaTeX typesetting system
cask 'mackup'                   # Backup and sync your files with Dropbox, Google Drive, Git, rsync, or S3
cask 'macs-fan-control'         # Controls and monitors all fans on Apple computers
cask 'mathpix-snipping-tool'    # OCR for math
cask 'miniconda'                # Minimal installer for conda
cask 'qbittorrent'              # BitTorrent client
cask 'raspberry-pi-imager'      # Imaging utility to install operating systems to a microSD card
cask 'sioyek'                   # PDF viewer designed for reading research papers and technical books
cask 'subler'                   # Mux and tag mp4 files
# cask 'tikzit'                   # Graph editor for TikZ
cask 'time-out'                 # Customizable timing of breaks
cask 'vlc'                      # Multimedia player
cask 'visual-studio-code'       # Open-source code editor
# cask 'xquartz'                  # Open-source version of the X.Org X server
# cask 'youtube-downloader'       # Simple menu bar app to download YouTube movies
cask 'zoom'                     # Video conferencing and web conferencing service

mas 'Sorted 3', id: 1306893526
mas 'WolframAlpha Classic', id: 334989259 
mas 'one sec', id: 1532875441
mas 'Toggl Track', id: 1291898086
mas 'Tailscale', id: 1475387142

vscode 'ms-python.python'
vscode 'ms-vscode.cpptools'
vscode 'ms-vscode-remote.remote-containers'
vscode 'GitHub.copilot'
vscode 'ms-vscode.remote-explorer'
vscode 'tomoki1207.pdf'
vscode 'ms-toolsai.datawrangler'
vscode 'ms-toolsai.jupyter'
vscode 'ms-toolsai.vscode-ai'
vscode 'MS-vsliveshare.vsliveshare'
vscode 'yzhang.markdown-all-in-one'
vscode 'ms-vscode.makefile-tools'
vscode 'Gruntfuggly.todo-tree'
vscode 'ms-python.black-formatter'
vscode 'eamodio.gitlens'
vscode 'ms-azuretools.vscode-docker'
